Revit 2027 API
UIControlledApplication.CreateRibbonPanel(Tab, String) Method
 Create a new RibbonPanel on the designated standard Revit tab.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual RibbonPanel CreateRibbonPanel(
	Tab tab,
	string panelName
)
Public Overridable Function CreateRibbonPanel (
	tab As Tab,
	panelName As String
) As RibbonPanel
public:
virtual RibbonPanel^ CreateRibbonPanel(
	Tab tab,
	String^ panelName
)
abstract CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
override CreateRibbonPanel :
        tab : Tab *
        panelName : string -> RibbonPanel
Parameters
tab Tab
The target tab, on which the new panel will be created.
panelName String
The name of the panel to be created.
Return Value
RibbonPanel
Exceptions
Exception | Condition
ArgumentNullException | panelName is null.
ArgumentException | panelName is Empty or the tab is not valid.
InvalidOperationException | If more than 100 panels were created or the tab cannot be found.
Remarks
 This method will create a custom panel appending to the specified tab. This method is not supported in Macros.
See Also
Reference
UIControlledApplication Class
CreateRibbonPanel Overload
Autodesk.Revit.UI Namespace